app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = 1 ORDER BY "documents"."created_at" DESC
---
  def index
    @documents = current_user.documents.order(created_at: :desc)

INSERT INTO "documents" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('My First LaTeX Document', '\documentclass{article}
---
  def create
    @document = current_user.documents.build(document_params)
    if @document.save

SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = 1 AND "documents"."id" = 1 LIMIT 1
---
  def set_document
    @document = current_user.documents.find(params[:id])